package com.stas.telegrambots;

import org.telegram.telegrambots.meta.api.objects.replykeyboard.InlineKeyboardMarkup;

public interface Key {
    InlineKeyboardMarkup markupInline(String[][]str);
    String[][] months = {
            { "январь:101" ,  "февраль:102", "март:103",   "апрель:104" },
            { "май:105" ,    "июнь:106",    "июль:107",  "август:108" },
            { "сентябрь:109", "октябрь:110", "ноябрь:111", "декабрь:112" }
    };
    String[][] days = {
            {"1:1", "2:2", "3:3", "4:4", "5:5", "6:6", "7:7", "8:8"},
            {"9:9", "10:10", "11:11", "12:12", "13:13", "14:14", "15:15", "16:16"},
            {"17:17", "18:18", "19:19", "20:20", "21:21", "22:22", "23:23", "24:24"},
            {"25:25", "26:26", "27:27", "28:28", "29:29", "30:30", "31:31"},
           {"enter:enter"}
    };
    String[][] years = {
            {"2008:2008", "2009:2009", "2010:2010"},
            {"2011:2011", "2012:2012", "2013:2013"},
            {"2014:2014", "2015:2015", "2016:2016"},
            {"2017:2017","2018:2018","2019:2019"}

    };
    String[][]start={
            {"Бросаю курить:go","Уже бросил:time1"},
            {"Сколько не курю?:time","Список лидеров:lider"}
    }; String[][]choice={
            {"Год:year"},
            {"Месяц:month"},
            {"День:day"}

    };

}
